/*
@output КЦ ИТ КПП Поддержка РМ
@output МРУрал ИТ КПП Поддержка РМ
@output МРСибирь ИТ КПП Поддержка РМ
@output МРДВ ИТ КПП Поддержка РМ
@output КЦ ИТ Сервисы дистанционной работы
*/

output = "";

arrayForIT = [
  "Арзамас",
  "Архангельск",
  "Астрахань",
  "Башкортостан",
  "Белгород",
  "Брянск",
  "Владикавказ",
  "Владимир",
  "Волгоград",
  "Волжск",
  "Вологда",
  "Воронеж",
  "Грозный",
  "Иваново",
  "Ижевск",
  "Йошкар-Ола",
  "Казань",
  "Калининград",
  "Калуга",
  "Карелия",
  "Киров",
  "Коми",
  "Кострома",
  "Краснодар",
  "Курск",
  "Липецк",
  "Майкоп",
  "Махачкала",
  "Москва и МО",
  "Москва",
  "Мурманск",
  "Набережные Челны",
  "Назрань",
  "Нальчик",
  "Нижнекамск",
  "Нижний Новгород",
  "Новгород Великий",
  "Новороссийск",
  "Орел",
  "Оренбург",
  "Пенза",
  "Петрозаводск",
  "Псков",
  "Ростов-на-Дону",
  "Рязань",
  "Самара",
  "Санкт-Петербург",
  "Саранск",
  "Саратов",
  "Саров",
  "Смоленск",
  "Сочи",
  "Ставрополь",
  "Старый Оскол",
  "Сыктывкар",
  "Тамбов",
  "Тверь",
  "Тула",
  "Ульяновск",
  "Чебоксары",
  "Черкесск",
  "Элиста",
  "Ярославль",
];

arrayForUral = [
  "Екатеринбург",
  "Курган",
  "Магнитогорск",
  "Нижневартовск",
  "Нижний Тагил",
  "Ноябрьск",
  "Нягань",
  "Пермь",
  "Сургут",
  "Тюмень",
  "Ханты-Мансийск",
  "Челябинск",
  "ЯНАО",
];

arrayForSiberia = [
  "Абакан",
  "Барнаул",
  "Горно-Алтайск",
  "Кемерово",
  "Красноярск",
  "Новокузнецк",
  "Новосибирск",
  "Норильск",
  "Омск",
  "Томск",
  "Тыва",
  "Хакасия",
];

arrayForFarEast = [
  "Анадырь",
  "Биробиджан",
  "Благовещенск",
  "Владивосток",
  "Иркутск",
  "Комсомольск-на-Амуре",
  "Магадан",
  "Петропавловск-Камчатский",
  "Улан-Удэ",
  "Хабаровск",
  "Чита",
  "Южно-Сахалинск",
  "Якутск",
];

if (
  (input_data.organizationType === "ГК МТС" ||
    input_data.connectionType === "VDI") &&
  includes(arrayForIT, input_data.region)
) {
  output = "КЦ ИТ КПП Поддержка РМ";
}

if (
  (input_data.organizationType === "ГК МТС" ||
    input_data.connectionType === "VDI") &&
  includes(arrayForUral, input_data.region)
) {
  output = "МРУрал ИТ КПП Поддержка РМ";
}

if (
  (input_data.organizationType === "ГК МТС" ||
    input_data.connectionType === "VDI") &&
  includes(arrayForSiberia, input_data.region)
) {
  output = "МРСибирь ИТ КПП Поддержка РМ";
}

if (
  (input_data.organizationType === "ГК МТС" ||
    input_data.connectionType === "VDI") &&
  includes(arrayForFarEast, input_data.region)
) {
  output = "МРДВ ИТ КПП Поддержка РМ";
}

if (input_data.organizationType === "Внешние контрагенты") {
  output = "КЦ ИТ Сервисы дистанционной работы";
}
